import {
  ADD_STATION,
  EDIT_STATION,
  DELETE_STATION,
  GET_STATIONS,
} from "../actions/station.const.js";



export function stations(state = stationsDefault, action) {
  switch (action.type) {
    case ADD_STATION:
      return state;

    case EDIT_STATION:
      return state;

    case DELETE_STATION:
      return state;

      case GET_STATIONS:
      return state;
    default:
      return state
  }
}

const stationsDefault = {
    // 1 : { name: "Педучилище"},
    // 2 : { name: "вул. Ушакова"},
    // 3 : { name: "3-я міська лікарня"},
    // 4 : { name: "вул. Маяковського"},
    // 5 : { name: "Площа 8-го Березня"},
    // 6 : { name: "вул. Замкова"},
    // 7 : { name: "вул. Московська"},
    // 8 : { name: "вул. Широцького Костя"},
    // 9 : { name: "Цегельний завод"},
    // 10 : { name: "вул. Дубовецька"},
    // 31 : { name: "вул. Брацлавська"},
    // 32 : { name: "Площа Перемоги"},
    // 33 : { name: "Центральний ринок"},
    // 34 : { name: "вул. Євгенія Пікуса"},
    // 35 : { name: "Залізничний вокзал"},
    // 40 : { name: "пл. Шкільна"},
    // 41 : { name: "вул. Івана Федорова"},
    // 42 : { name: "вул. Молодогвардійська"},
    // 43 : { name: "вул. Сірка Івана"},
    // 45 : { name: "Муніципальний ринок"},
    // 46 : { name: "ГБК \"Зірка\""},
    // 47 : { name: "вул. Гайдамацька"},
    // 48 : { name: "вул. Гонти"},
    // 49 : { name: "Фабрика \"Рошен\""},
    // 50 : { name: "вул. Батозька"},
    // 51 : { name: "ЦПТО №1"},
    // 52 : { name: "Мікрорайон ВПЗ"},
    // 60: { name: "Дитячий санаторій ім. М. М. Коцюбинського"},
    // 61: { name: "Профілакторій"},
    // 62: { name: "вул. Українська"},
    // 71:{ name: "вул. Якова Шепеля"},
    // 72:{ name: "вул. Якова Гальчевського"},
    // 73:{ name: "ЗОШ №11"},
    // 74:{ name: "ЗОШ №19"},
    // 75:{ name: "пл. С. Наливайка"},
    // 76:{ name: "вул. Князів Коріатовичів"},
    // 77:{ name: "Майдан Незалежності"},
    // 78:{ name: "вул. Театральна"},
    // 79:{ name: "вул. Отамановського Валентина"},
    // 80:{ name: "Лікарня ім. Пирогова"},
    // 81:{ name: "Ринок \"Урожай\""},
    // 82:{ name: "вул. Академіка Заболотного"},
    // 83:{ name: "вул. Дачна"},
    // 84:{ name: "вул. Академіка Павлова"},
    // 85:{ name: "Податкова"},
    // 86:{ name: "Завод \"Форт\""},
    // 87:{ name: "вул. 600-річчя"},
    // 88:{ name: "пр. Космонавтів"},
    // 89:{ name: "вул. Келецька"},
    // 90:{ name: "вул. Андрія Первозванного"},
    // 91:{ name: "Музей-садиба Пирогова"},
    // 92:{ name: "вул. Комарова"},
    // 93:{ name: "Пирогово (на вимогу)"},
    // 94:{ name: "Склеп М. І. Пирогова"},
    // 101: { name: "вул. Шевченка"},
    // 102: { name: "вул. Лялі Ратушної"},
    // 103: { name: "вул. Порика"},
    // 104: { name: "Вінницький технічний коледж"},
    // 105: { name: "Вінницький національний технічний університет"},
    // 106: { name: "Західний автовокзал"},
    // 107: { name: "100-річчя Вінницького трамвая"},
  }